scalaForSeniors.org
#+Title: What's the deal with Scala
#+Author: Khan
#+REVEAL_ROOT: https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.7.0/
#+REVEAL_EXTRA_CSS: ./scalaForSeniors.css
#+OPTIONS: num:nil toc:nil reveal_history:t
#+OPTIONS: reveal_title_slide:"<h1>%t</h1>"
#+REVEAL_HLEVEL: 1
#+REVEAL_TRANS: Slide
#+REVEAL_THEME: Blood

* Scala for senior engineers
- What makes it different
- How is it the same
#+BEGIN_NOTES
So the purpose of this talk is to give a pretty high level overview of scala as a language.

I'm going to assume everyone here is fairly familiar with C#/Java, with which scala has a sort of genetic relationship. By genetic relationship, I mean that scala has been heavily influenced
by these languages, and a lot of the muscle memory you pick up from them will work just as well in scala. There are a few additional things that are worth mentioning, which I'll get to shortly.

The point of this isn't really to introduce functional programming, or to teach anybody about monads or applicative functors, but rather just 
a quick chat about the features that scala brings to the table. Feel free to interupt me with questions as we go, I haven't given this talk before, so I won't have covered everything, so any points
you'd like to make or questions you have I'd appreciate hearing them.

I hope by the end of this rant you'll have a better appreciation for why one should bother with scala in the first place.
#+END_NOTES
* Unique features
- Implicits
#+BEGIN_SRC scala
def doTheThing(a: Int, b: Int)(implicit logger: Logger): Int {
  logger.debug(s"Adding $a + $b")
  a + b
}
#+END_SRC
- Higher kinded types/type constructors
#+BEGIN_SRC scala
trait Logger[F[_]] {
  def log(message: String): F[Unit]  
}
def doAnotherThing[F[_]](arg: String)(implicit logger: Logger[F]): String
#+END_SRC
- Closed hierarchies
#+BEGIN_NOTES
I'm by no means an expert scala user, but I have been writing some scala recently, and there are three things that I think make scala unique. I'll go into more details each of these
so this is just an overview.

The first thing you'll encounter in scala are implicits, where the compiler will find a value in scope for you, and fail compilation if one isn't there.

There are also what are known as higher kinded types. These are just generics from c#/java, but in scala you can use them as parameters.

The final thing is that in scala, you can have classes that can no longer be inherited from, outside of the scope of the file they exist in. This is also known as an algebraic data type, or sometimes
you'll see it refered to as just an algebra. 
#+END_NOTES
* Implicits
- Scala compiler searches for values in scope for you
- This is the backbone of scala abstraction
- Implements everything from dependency injection to generic programming to monads
#+BEGIN_SRC scala
// See Ma, no IoC framework needed
def main() {
  implicit val logger: Logger[IO] = Logger.makeIOLogger()
  run[IO]
}
def run[F[_]]()(implicit val logger: Logger[F]): F[Int] { ??? }
#+END_SRC
#+BEGIN_NOTES
Implicits are the feature of scala that sets it apart from other languages. 

In most languages, you will pass all your values in manually, which pushes us toward having dependency injection at a class level where we pass all our dependencies in via a constructors.

In scala, the compiler will search for a value in scope and if it doesn't find it it will fail to compile. This is useful when you want to talk about an implementation of a trait (what scala calls it's 
interfaces) that can be passed in to a method.
#+END_NOTES
