scalaForSeniors.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>What's the deal with Scala</title>
<meta name="author" content="(Khan)"/>
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.7.0/css/reveal.css"/>

<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/reveal.js/3.7.0/css/theme/Blood.css" id="theme"/>

<link rel="stylesheet" href="./scalaForSeniors.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1>What's the deal with Scala</h1>
</section>

<section>
<section id="slide-org6b6f334">
<h2 id="org6b6f334">Scala for senior engineers</h2>
<ul>
<li>What makes it different</li>
<li>How is it the same</li>

</ul>
<aside class="notes">
<p>
So the purpose of this talk is to give a pretty high level overview of scala as a language.
</p>

<p>
I'm going to assume everyone here is fairly familiar with C#/Java, with which scala has a sort of genetic relationship. By genetic relationship, I mean that scala has been heavily influenced
by these languages, and a lot of the muscle memory you pick up from them will work just as well in scala. There are a few additional things that are worth mentioning, which I'll get to shortly.
</p>

<p>
The point of this isn't really to introduce functional programming, or to teach anybody about monads or applicative functors, but rather just 
a quick chat about the features that scala brings to the table. Feel free to interupt me with questions as we go, I haven't given this talk before, so I won't have covered everything, so any points
you'd like to make or questions you have I'd appreciate hearing them.
</p>

<p>
I hope by the end of this rant you'll have a better appreciation for why one should bother with scala in the first place.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orgfc8f9d3">
<h2 id="orgfc8f9d3">Unique features</h2>
<ul>
<li>Implicits</li>

</ul>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">doTheThing</span><span style="color: #4f97d7;">(</span>a<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Int</span>, b<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Int</span><span style="color: #4f97d7;">)(</span><span style="color: #4f97d7;">implicit</span> logger<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Logger</span><span style="color: #4f97d7;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Int</span> <span style="color: #4f97d7;">{</span>
  logger.debug<span style="color: #bc6ec5;">(</span>s<span style="color: #2d9574;">"Adding </span><span style="color: #7590db;">$a</span><span style="color: #2d9574;"> + </span><span style="color: #7590db;">$b</span><span style="color: #2d9574;">"</span><span style="color: #bc6ec5;">)</span>
  a + b
<span style="color: #4f97d7;">}</span>
</pre>
</div>
<ul>
<li>Higher kinded types/type constructors</li>

</ul>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">trait</span> <span style="color: #ce537a; font-weight: bold;">Logger</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">log</span><span style="color: #bc6ec5;">(</span>message<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">Unit</span><span style="color: #bc6ec5;">]</span>  
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">doAnotherThing</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">](</span>arg<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">String</span><span style="color: #4f97d7;">)(</span><span style="color: #4f97d7;">implicit</span> logger<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Logger</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">String</span>
</pre>
</div>
<ul>
<li>Closed hierarchies</li>

</ul>
<aside class="notes">
<p>
I'm by no means an expert scala user, but I have been writing some scala recently, and there are three things that I think make scala unique. I'll go into more details each of these
so this is just an overview.
</p>

<p>
The first thing you'll encounter in scala are implicits, where the compiler will find a value in scope for you, and fail compilation if one isn't there.
</p>

<p>
There are also what are known as higher kinded types. These are just generics from c#/java, but in scala you can use them as parameters.
</p>

<p>
The final thing is that in scala, you can have classes that can no longer be inherited from, outside of the scope of the file they exist in. This is also known as an algebraic data type, or sometimes
you'll see it refered to as just an algebra. 
</p>

</aside>
</section>
</section>
<section>
<section id="slide-orge61aebe">
<h2 id="orge61aebe">Implicits</h2>
<ul>
<li>Scala compiler searches for values in scope for you</li>
<li>This is the backbone of scala abstraction</li>
<li>Implements everything from dependency injection to generic programming to monads</li>

</ul>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">See Ma, no IoC framework needed</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">main</span><span style="color: #4f97d7;">()</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7;">implicit</span> <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">logger</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Logger</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">IO</span><span style="color: #bc6ec5;">]</span> <span style="color: #4f97d7; font-weight: bold;">=</span> <span style="color: #a45bad;">Logger</span>.makeIOLogger<span style="color: #bc6ec5;">()</span>
  run<span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">IO</span><span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">run</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]()(</span><span style="color: #4f97d7;">implicit</span> <span style="color: #4f97d7; font-weight: bold;">val</span> <span style="color: #7590db;">logger</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Logger</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">Int</span><span style="color: #4f97d7;">]</span> <span style="color: #4f97d7;">{</span> ??? <span style="color: #4f97d7;">}</span>
</pre>
</div>
<aside class="notes">
<p>
Implicits are the feature of scala that sets it apart from other languages. 
</p>

<p>
In most languages, you will pass all your values in manually, which pushes us toward having dependency injection at a class level where we pass all our dependencies in via a constructors.
</p>

<p>
In scala, the compiler will search for a value in scope and if it doesn't find it it will fail to compile. This is useful when you want to talk about an implementation of a trait (what scala calls it's 
interfaces) that can be passed in to a method.
</p>

</aside>
</section>
