scalaForSeniors.org
** Implicits for extension
#+BEGIN_SRC scala
def findSmallest[A](items: NonEmptyList[A])(implicit ordering: Ord[A]): A
#+END_SRC
#+BEGIN_NOTES
So here we have an example of implicits being used to provide generic programming, where we have an implicit "witness" that whatever `A` we pass in has some kind of ordering defined.
As this is generic, it could numerical, or string based, or perhaps some kind of priority for database connections.

This is a kind of post-hoc extension, which is equivalent to being able to implement interfaces for classes that you don't control. So perhaps there's a new abstraction you want to play with;
or a new database framework that can persist values if they implement a particular interface; or someone forgot to implement an ordering for their fancy numbers library; you can now 
implement all those without having to change the original class.

In haskell, this kind of post hoc extension has meant that all sorts of libraries and ways of putting programs together have gradually emerged out of a lot of galaxy-brain level 
engineers trying to write better code.

Scala takes a similar approach, but it also has it's instances as first class values, which I think is pretty neat. Having them as first class values means that you can instantiate the particular
instance you want, and it means that you can mouse over the implicit in an idea and see what it's being resolved to.
#+END_NOTES
* Higher kinded types
- You can talk about generic types without having all their parameters applied, eg. ~F[_]~ instead of ~F[Int]~ 
#+BEGIN_SRC scala
trait Applicative[F[_]] {
  def point[A](a: A): F[A]
  def apply[A, B](applicative: F[A], mappingFunction: F[A => B]): F[B]
}
// This works for any applicative and doesn't erase it's type
def apply3[F[_], A, B, C, D]
  (a: F[A], b: F[B], c: F[C], mappingFunction: F[A => B => C => D])
  (implicit applicative: Applicative[F]): F[D] =
    applicative.ap(applicative.ap(applicative.ap(mappingFunction)(a))(b))(c)
#+END_SRC
#+BEGIN_NOTES
While implicits are definitely the defining feature of scala, higher kinded types are what allow functional programming of the haskell strongly typed variety.

This means that you can write some very general abstractions, and a wealth of functionality falls out, in the same way that generic programming lets us write 
methods for all lists/enumerables, we can write code about all things that are parameterised by another type. Things like `Select` from C# are a good example of this,
where you can use the `linq` syntax for not just collections, but any type that implements a special method. This is achieved by some compiler trickery.

In scala this is first class. It means that we don't have to cast things down to an interface and cast them back when we're done.
#+END_NOTES
