scalaForSeniors.html
<section id="slide-orgd1f3333">
<h3 id="orgd1f3333">Implicits for extension</h3>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">findSmallest</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">A</span><span style="color: #4f97d7;">](</span>items<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">NonEmptyList</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)(</span><span style="color: #4f97d7;">implicit</span> ordering<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Ord</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span>
</pre>
</div>
<aside class="notes">
<p>
So here we have an example of implicits being used to provide generic programming, where we have an implicit "witness" that whatever `A` we pass in has some kind of ordering defined.
As this is generic, it could numerical, or string based, or perhaps some kind of priority for database connections.
</p>

<p>
This is a kind of post-hoc extension, which is equivalent to being able to implement interfaces for classes that you don't control. So perhaps there's a new abstraction you want to play with;
or a new database framework that can persist values if they implement a particular interface; or someone forgot to implement an ordering for their fancy numbers library; you can now 
implement all those without having to change the original class.
</p>

<p>
In haskell, this kind of post hoc extension has meant that all sorts of libraries and ways of putting programs together have gradually emerged out of a lot of galaxy-brain level 
engineers trying to write better code.
</p>

<p>
Scala takes a similar approach, but it also has it's instances as first class values, which I think is pretty neat. Having them as first class values means that you can instantiate the particular
instance you want, and it means that you can mouse over the implicit in an idea and see what it's being resolved to.
</p>

</aside>
</section>
</section>
<section>
<section id="slide-org00dc319">
<h2 id="org00dc319">Higher kinded types</h2>
<ul>
<li>You can talk about generic types without having all their parameters applied, eg. <code>F[_]</code> instead of <code>F[Int]</code></li>

</ul>
<div class="org-src-container">

<pre  class="src src-scala"><span style="color: #4f97d7; font-weight: bold;">trait</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">]</span> <span style="color: #4f97d7;">{</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">point</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span><span style="color: #bc6ec5;">](</span>a<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span><span style="color: #bc6ec5;">]</span>
  <span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">apply</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span>, <span style="color: #a45bad;">B</span><span style="color: #bc6ec5;">](</span>applicative<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">A</span><span style="color: #2d9574;">]</span>, mappingFunction<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #2d9574;">[</span><span style="color: #a45bad;">A</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">B</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">B</span><span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This works for any applicative and doesn't erase it's type</span>
<span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">apply3</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #4f97d7; font-weight: bold;">_</span><span style="color: #bc6ec5;">]</span>, <span style="color: #a45bad;">A</span>, <span style="color: #a45bad;">B</span>, <span style="color: #a45bad;">C</span>, <span style="color: #a45bad;">D</span><span style="color: #4f97d7;">]</span>
  <span style="color: #4f97d7;">(</span>a<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span><span style="color: #bc6ec5;">]</span>, b<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">B</span><span style="color: #bc6ec5;">]</span>, c<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">C</span><span style="color: #bc6ec5;">]</span>, mappingFunction<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">A</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">B</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">C</span> <span style="color: #4f97d7; font-weight: bold;">=&gt;</span> <span style="color: #a45bad;">D</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span>
  <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">implicit</span> applicative<span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">Applicative</span><span style="color: #bc6ec5;">[</span><span style="color: #a45bad;">F</span><span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span><span style="color: #4f97d7; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">F</span><span style="color: #4f97d7;">[</span><span style="color: #a45bad;">D</span><span style="color: #4f97d7;">]</span> <span style="color: #4f97d7; font-weight: bold;">=</span>
    applicative.ap<span style="color: #4f97d7;">(</span>applicative.ap<span style="color: #bc6ec5;">(</span>applicative.ap<span style="color: #2d9574;">(</span>mappingFunction<span style="color: #2d9574;">)(</span>a<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)(</span>b<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)(</span>c<span style="color: #4f97d7;">)</span>
</pre>
</div>
<aside class="notes">
<p>
While implicits are definitely the defining feature of scala, higher kinded types are what allow functional programming of the haskell strongly typed variety.
</p>

<p>
This means that you can write some very general abstractions, and a wealth of functionality falls out, in the same way that generic programming lets us write 
methods for all lists/enumerables, we can write code about all things that are parameterised by another type. Things like `Select` from C# are a good example of this,
where you can use the `linq` syntax for not just collections, but any type that implements a special method. This is achieved by some compiler trickery.
</p>

<p>
In scala this is first class. It means that we don't have to cast things down to an interface and cast them back when we're done.
</p>

</aside>
</section>
</section>
